Autodesk.Revit.DB.ExportUtils.GetNurbsSurfaceDataForSurface(Autodesk.Revit.DB.Surface)
Returns the necessary information to define a NURBS surface
for a given Autodesk::Revit::DB::HermiteSuface or Autodesk::Revit::DB::RuledSuface.
Remarks:
This function is intended for export purposes.
surface:
The HermiteSurface or RuledSurface to be converted.
Returns:
A class containing the necessary data to define a NURBS surface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This surface type is not supported for this function.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Couldn't get NURBS data from surface.
Since:
2021